# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [269]:
#Write your code here
import pandas as pd

df_data=pd.read_csv('Purchase_Data.csv')

df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [270]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [271]:
#Write you code here
result_1 = df_data.loc[:, df_data.columns[:2]]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [272]:
#Write you code here
result_2 = df_data.loc[df_data.index[:2], :]

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [273]:
#Write your code here
result_3 = df_data.loc[df_data.index[:5], df_data.columns[:5]]

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [274]:
#Write your code here
result_4 = df_data.loc[[0, 2, 4], :]

Store the number rows in a variable called num_rows.

In [275]:
#Write your code here
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [276]:
#Write your code here
last_row = df_data.loc[num_rows - 1, :]
last_row

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [277]:
#Write your code here
avg_price = df_data['price'].mean()
max_price = df_data['price'].max()

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [278]:
#Write you code here
avg_price = df_data['price'].mean()
avg_num_items = df_data['num_item'].mean()

Create a column called "total", which is the product of the price and num_item columns.

In [279]:
#Write your code here
total = df_data['price'] * df_data['num_item']

What is the avgerage price of the three most expensive purchases?

In [280]:
#Write your code here
avg_price = df_data.nlargest(3, 'price')['price'].mean()

How many different products are there?

In [281]:
#Write your code here
df_data.nunique()['product_id']

np.int64(53)

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [282]:
#Write your code here
difference = max_price - avg_price
df_data.describe()

       invoice_number    product_id    category_id     num_item        price
count    5.382000e+03  5.382000e+03    5382.000000  5382.000000  5382.000000
mean     2.020000e+11  8.740911e+06  115465.616499     1.298309     3.192052
std      0.000000e+00  5.048294e+06   65448.435316     2.168725     1.652007
min      2.020000e+11  7.000034e+06   70101.000000     0.500000     0.000000
25%      2.020000e+11  7.070884e+06   70201.000000     1.000000     2.000000
50%      2.020000e+11  7.071096e+06   70401.000000     1.000000     2.500000
75%      2.020000e+11  7.090592e+06  210101.000000     1.000000     5.000000
max      2.020000e+11  3.000077e+07  210301.000000   116.000000     6.010000

Use the drop() method to delete the column total from the dataframe df_data.

In [283]:
#Write your code here
df_data.drop(['price', 'num_item'], axis=1, inplace=True)

Let's dig a little deeper into the data set and answer some basic question.

In [284]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [285]:
#Write your code here
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])
df_data.dtypes

C:\Users\User\AppData\Local\Temp\ipykernel_15916\1697094632.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [259]:
#Write your code here
DOW = df_data['invoice_time'].dt.day_name()
Month = df_data['invoice_time'].dt.month_name()

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [261]:
#Write your code here
num_purchases_wednesday = df_data[df_data['invoice_time'].dt.day_name() == 'Wednesday'].shape[0]

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [328]:
df_titanic = pd.read_csv('Titanic.csv')

df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [333]:
#Write your code here
df_titanic.columns
df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'}, inplace=True)

Change the index of the df_titanic to the column PasengerID.

In [329]:
#Write your code here
df_titanic.set_index('PassengerId', inplace=True)

In [310]:
df_titanic.columns

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket_Num',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [332]:
df_titanic.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [331]:
df_titanic.iloc[4]

Pclass                                                 3
Name        Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Sex                                               female
Age                                                 22.0
SibSp                                                  1
Parch                                                  1
Ticket                                           3101298
Fare                                             12.2875
Cabin                                                NaN
Embarked                                               S
Name: 896, dtype: object

In [334]:
#Write your code here
df_titanic.loc[896, "Passenger_Name"]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [296]:
#Write your code here
df_titanic.reset_index(inplace=True)

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [289]:
#Write you code here
df_titanic.isnull().sum()

Passenger_Name      0
PassengerId         0
Pclass              0
Sex                 0
Age                86
SibSp               0
Parch               0
Ticket_Num          0
Fare                1
Cabin             327
Embarked            0
dtype: int64

Compute the avg age of passengers ignoring the missing data.

In [ ]:
#Write your code here
mean = df_titanic['Age'].mean(numeric_only=True)

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [295]:
#Write your code here
df_titanic.fillna({'Age': df_titanic['Age'].mean()}, inplace=True)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [335]:
#Write your code here
avg_age = df_titanic.nlargest(5, 'Age')['Age'].mean()